cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Binaries
brew 'git'
brew 'mackup'
brew 'mas'
brew 'node'

# Apps
cask 'alfred'
cask 'dropbox'
cask 'discord'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'mysqlworkbench'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'textual'
cask 'ubersicht'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Fonts
# cask 'font-source-code-pro'

# Install Mac App Store apps
mas '1Password', id: 443987910